In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
#需要有相同名字的列，且列中有相同元素


df1=DataFrame({"key":['x','y','z'],'data_set_1':[1,2,3]})

In [3]:
df1

  key  data_set_1
0   x           1
1   y           2
2   z           3

In [15]:
df2 = DataFrame({'key':['x','B','C'],'data_set_2':[4,5,6]})

In [16]:
df2

  key  data_set_2
0   x           4
1   B           5
2   C           6

In [17]:
pd.merge(df1,df2)

  key  data_set_1  data_set_2
0   x           1           4

In [18]:
pd.merge(df1,df2,on='key')

  key  data_set_1  data_set_2
0   x           1           4

In [19]:
pd.merge(df1,df2,on='key',how="left")

  key  data_set_1  data_set_2
0   x           1         4.0
1   y           2         NaN
2   z           3         NaN

In [20]:
pd.merge(df1,df2,on='key',how='right')

  key  data_set_1  data_set_2
0   x         1.0           4
1   B         NaN           5
2   C         NaN           6

In [22]:
pd.merge(df1,df2,on='key',how='outer')

  key  data_set_1  data_set_2
0   x         1.0         4.0
1   y         2.0         NaN
2   z         3.0         NaN
3   B         NaN         5.0
4   C         NaN         6.0